package com.su.app;

public class CommonData {
    public static String[][] BIRTH_NOTIFY_DAY = {
            {"正月", "初一", "南无弥勒菩萨生日、十斋期"},
            {"正月", "初六", "南无定光佛生日"},
            {"正月", "初八", "观音斋、六斋期、十斋期"},
            {"正月", "初九", "帝释天尊圣诞"},
            {"正月", "十四", "六斋期、十斋期"},
            {"正月", "十五", "六斋期、十斋期"},
            {"正月", "十八", "十斋期"},
            {"正月", "廿三", "六斋期、十斋期"},
            {"正月", "廿四", "十斋期"},
            {"正月", "廿八", "十斋期"},
            {"正月", "廿九", "六斋期、十斋期"},
            {"正月", "卅十", "六斋期、十斋期"},



            {"二月", "初一", "十斋期"},
            {"二月", "初七", "观音斋"},
            {"二月", "初八", "南无释迦牟尼佛出家日、六斋期、十斋期"},
            {"二月", "初九", "观音斋"},
            {"二月", "十四", "六斋期、十斋期"},
            {"二月", "十五", "南无释迦牟尼佛涅磐日、六斋期、十斋期"},
            {"二月", "十八", "十斋期"},
            {"二月", "十九", "南无观世音菩萨生日、观音斋"},
            {"二月", "廿一", "南无普贤菩萨生日"},
            {"二月", "廿三", "六斋期、十斋期"},
            {"二月", "廿四", "十斋期"},
            {"二月", "廿八", "十斋期"},
            {"二月", "廿九", "六斋期、十斋期"},
            {"二月", "卅十", "六斋期、十斋期"},





            {"三月", "初一", "十斋期"},
            {"三月", "初三", "观音斋"},
            {"三月", "初六", "观音斋"},
            {"三月", "初八", "六斋期、十斋期"},
            {"三月", "十三", "观音斋"},
            {"三月", "十四", "六斋期、十斋期"},
            {"三月", "十五", "六斋期、十斋期"},
            {"三月", "十六", "南无准提菩萨生日"},
            {"三月", "十八", "十斋期"},
            {"三月", "廿三", "六斋期、十斋期"},
            {"三月", "廿四", "十斋期"},
            {"三月", "廿五", "南无多宝佛生日"},
            {"三月", "廿八", "十斋期"},
            {"三月", "廿九", "六斋期、十斋期"},
            {"三月", "卅十", "六斋期、十斋期"},




            {"四月", "初一", "十斋期"},
            {"四月", "初四", "南无文殊菩萨生日"},
            {"四月", "初八", "南无释迦牟尼佛生日、六斋期、十斋期"},
            {"四月", "十四", "六斋期、十斋期"},
            {"四月", "十五", "六斋期、十斋期"},
            {"四月", "十八", "十斋期"},
            {"四月", "廿二", "观音斋"},
            {"四月", "廿三", "六斋期、十斋期"},
            {"四月", "廿四", "十斋期"},
            {"四月", "廿八", "南无药王菩萨生日、十斋期"},
            {"四月", "廿九", "六斋期、十斋期"},
            {"四月", "卅十", "六斋期、十斋期"},


            {"五月", "初一", "十斋期"},
            {"五月", "初三", "观音斋"},
            {"五月", "初八", "六斋期、十斋期"},
            {"五月", "十三", "南无伽蓝菩萨生日"},
            {"五月", "十四", "六斋期、十斋期"},
            {"五月", "十五", "六斋期、十斋期"},
            {"五月", "十七", "观音斋"},
            {"五月", "十八", "十斋期"},
            {"五月", "廿三", "六斋期、十斋期"},
            {"五月", "廿四", "十斋期"},
            {"五月", "廿八", "十斋期"},
            {"五月", "廿九", "六斋期、十斋期"},
            {"五月", "卅十", "六斋期、十斋期"},






            {"六月", "初一", "十斋期"},
            {"六月", "初三", "南无韦驮菩萨生日"},
            {"六月", "初八", "六斋期、十斋期"},
            {"六月", "十四", "六斋期、十斋期"},
            {"六月", "十五", "六斋期、十斋期"},
            {"六月", "十六", "观音斋"},
            {"六月", "十八", "观音斋、十斋期"},
            {"六月", "十九", "南无观世音菩萨成道日、观音斋"},
            {"六月", "廿三", "观音斋、六斋期、十斋期"},
            {"六月", "廿四", "十斋期"},
            {"六月", "廿八", "十斋期"},
            {"六月", "廿九", "六斋期、十斋期"},
            {"六月", "卅十", "六斋期、十斋期"},



            {"七月", "初一", "十斋期"},
            {"七月", "初八", "六斋期、十斋期"},
            {"七月", "十三", "南无大势至菩萨生日、观音斋"},
            {"七月", "十四", "六斋期、十斋期"},
            {"七月", "十五", "南无诸佛欢喜日(盂兰盆会)、六斋期、十斋期"},
            {"七月", "十八", "十斋期"},
            {"七月", "廿一", "南无普庵祖师生日"},
            {"七月", "廿三", "六斋期、十斋期"},
            {"七月", "廿四", "南无龙树菩萨生日、十斋期"},
            {"七月", "廿八", "十斋期"},
            {"七月", "廿九", "六斋期、十斋期"},
            {"七月", "卅十", "南无地藏王菩萨生日、六斋期、十斋期"},


            {"八月", "初一", "十斋期"},
            {"八月", "初八", "六斋期、十斋期"},
            {"八月", "十四", "六斋期、十斋期"},
            {"八月", "十五", "南无月光菩萨生日、六斋期、十斋期"},
            {"八月", "十六", "观音斋"},
            {"八月", "十八", "十斋期"},
            {"八月", "廿二", "南无燃灯古佛生日"},
            {"八月", "廿三", "六斋期、十斋期"},
            {"八月", "廿四", "十斋期"},
            {"八月", "廿八", "十斋期"},
            {"八月", "廿九", "六斋期、十斋期"},
            {"八月", "卅十", "六斋期、十斋期"},




            {"九月", "初一", "十斋期"},
            {"九月", "初八", "六斋期、十斋期"},
            {"九月", "十四", "六斋期、十斋期"},
            {"九月", "十五", "六斋期、十斋期"},
            {"九月", "十八", "十斋期"},
            {"九月", "十九", "南无观世音菩萨出家日、观音斋"},
            {"九月", "廿三", "观音斋、六斋期、十斋期"},
            {"九月", "廿四", "十斋期"},
            {"九月", "廿八", "十斋期"},
            {"九月", "廿九", "六斋期、十斋期"},
            {"九月", "卅十", "南无药师琉璃光佛生日、六斋期、十斋期"},






            {"十月", "初一", "十斋期"},
            {"十月", "初二", "观音斋"},
            {"十月", "初五", "南无达摩祖师生日"},
            {"十月", "初八", "六斋期、十斋期"},
            {"十月", "十四", "六斋期、十斋期"},
            {"十月", "十五", "六斋期、十斋期"},
            {"十月", "十八", "十斋期"},
            {"十月", "廿三", "六斋期、十斋期"},
            {"十月", "廿四", "十斋期"},
            {"十月", "廿八", "十斋期"},
            {"十月", "廿九", "六斋期、十斋期"},
            {"十月", "卅十", "六斋期、十斋期"},





            {"十一月", "初一", "十斋期"},
            {"十一月", "初八", "六斋期、十斋期"},
            {"十一月", "十四", "六斋期、十斋期"},
            {"十一月", "十五", "六斋期、十斋期"},
            {"十一月", "十七", "南无阿弥陀佛生日"},
            {"十一月", "十八", "十斋期"},
            {"十一月", "十九", "南无日光菩萨生日、观音斋"},
            {"十一月", "廿三", "六斋期、十斋期"},
            {"十一月", "廿四", "观音斋、十斋期"},
            {"十一月", "廿八", "十斋期"},
            {"十一月", "廿九", "六斋期、十斋期"},
            {"十一月", "卅十", "六斋期、十斋期"},



            {"十二月", "初一", "十斋期"},
            {"十二月", "初八", "南无释迦牟尼成道日、六斋期、十斋期"},
            {"十二月", "十四", "六斋期、十斋期"},
            {"十二月", "十五", "六斋期、十斋期"},
            {"十二月", "十八", "十斋期"},
            {"十二月", "廿三", "六斋期、十斋期"},
            {"十二月", "廿四", "十斋期"},
            {"十二月", "廿五", "观音斋"},
            {"十二月", "廿八", "十斋期"},
            {"十二月", "廿九", "南无华严菩萨生日、六斋期、十斋期"},
            {"十二月", "卅十", "六斋期、十斋期"},




    };


}
