package com.su.app;

public class CommonData {
	public static String[][] BIRTH_NOTIFY_DAY = {
		{"正月","初一","弥勒菩萨生日"},
		{"正月","初六","定光佛生日"},
		{"正月","初八","释迦牟尼佛出家日"},
		{"二月","十五","释迦牟尼佛涅磐日"},
		{"二月","十九","观世音菩萨生日"},
		{"二月","廿一","普贤菩萨生日"},
		{"三月","十六","准提菩萨生日"},
		{"三月","廿五","多宝佛生日"},
		{"四月","初四","文殊菩萨生日"},
		{"四月","初八","释迦牟尼佛生日"},
		{"四月","廿八","药王菩萨生日"},
		{"五月","十三","伽蓝菩萨生日"},
		{"六月","初三","韦驮菩萨生日"},
		{"六月","十九","观世音菩萨成道日"},
		{"七月","十三","大势至菩萨生日"},
		{"七月","十五","诸佛欢喜日(盂兰盆会)"},
		{"七月","廿一","普庵菩萨生日"},
		{"七月","廿四","龙树菩萨生日"},
		{"七月","卅十","地藏菩萨生日"},
		{"八月","十五","月光菩萨生日"},
		{"八月","廿二","燃灯古佛生日"},
		{"九月","十九","观世音菩萨出家日"},
		{"九月","卅十","药师玻璃光佛生日"},
		{"十月","初五","达摩祖师生日"},
		{"十一月","十七","阿弥陀佛生日"},
		{"十一月","十九","日光菩萨生日"},
		{"十二月","初八","释迦牟尼成道日"},
		{"十二月","廿九","华严菩萨生日"},
	};
	
	
	
	 


}
